## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 7 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                     NAME                                     |
|----------|------------------------------------------------------------------------------|
| add      | `aws_acmpca_certificate.client_vpn`                                          |
|          | `aws_acmpca_certificate_authority.client_vpn`                                |
|          | `aws_acmpca_certificate_authority_certificate.client_vpn`                    |
| delete   | `tls_private_key.client_vpn`                                                 |
|          | `tls_self_signed_cert.client_vpn`                                            |
| update   | `aws_cloudwatch_dashboard.notify_system[0]`                                  |
|          | `aws_cloudwatch_log_metric_filter.celery-error[0]`                           |
|          | `aws_cloudwatch_metric_alarm.service-callback-too-many-failures-critical[0]` |
|          | `aws_cloudwatch_query_definition.celery-errors[0]`                           |
|          | `aws_eks_node_group.notification-canada-ca-eks-node-group-k8s`               |
|          | `module.gha_vpn.aws_ec2_client_vpn_endpoint.this`                            |
|          | `module.vpn.aws_ec2_client_vpn_endpoint.this`                                |
| recreate | `aws_acm_certificate.client_vpn`                                             |
|          | `aws_secretsmanager_secret_version.eks_karpenter_ami_id`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.client_vpn must be replaced
+/- resource "aws_acm_certificate" "client_vpn" {
      ~ arn                       = "arn:aws:acm:ca-central-1:296255494825:certificate/f34d679e-9167-41ff-b525-2a816f6883cd" -> (known after apply)
      + certificate_authority_arn = (known after apply) # forces replacement
      - certificate_body          = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDOjCCAiKgAwIBAgIRANUi7I1BEAhBhsuqlkDRcV0wDQYJKoZIhvcNAQELBQAw
            MDEuMCwGA1UEAxMldnBuLnByb2R1Y3Rpb24ubm90aWZpY2F0aW9uLmNhbmFkYS5j
            YTAeFw0yNDAxMTExNjAyMjFaFw0yOTAxMDkxNjAyMjFaMDAxLjAsBgNVBAMTJXZw
            bi5wcm9kdWN0aW9uLm5vdGlmaWNhdGlvbi5jYW5hZGEuY2EwggEiMA0GCSqGSIb3
            DQEBAQUAA4IBDwAwggEKAoIBAQDDcgsiKuSEy7rH/2+J386LCPGLps43JJDhGr3K
            zNXnzoF5KftkJonhqXWuMFs8SnHlxF+M0v6OypOmqN56w7kQS5KmxyyEUjd8CTmP
            pv2/wsq04w67jgwcbcX9AH0o+mZyj0VeYdlzuqesFgyw7zZlnXta2rEURgCH7uW8
            7xVwwaOrX3ezzvaT1IVNesY9/O970AyD5vxkkUVe/otUCQXLlf1gZlzlKNOLQO+g
            TK0AgtE4b0CmfW8ZbrUhjcSgCJg8hid90CXmILzPxCIZC07OsZXt2HPzBLBRDzid
            ckdaZQULI/RPfuo+MdMbuzwLA/fNHOYT+Wo6666MaAI3kNBFAgMBAAGjTzBNMA4G
            A1UdDwEB/wQEAwICpDAtBgNVHSUEJjAkBggrBgEFBQcDAQYIKwYBBQUHAwUGCCsG
            AQUFBwMGBgRVHSUAMAwGA1UdEwEB/wQCMAAwDQYJKoZIhvcNAQELBQADggEBABHR
            4XWiSKSkVfwvjavihQDbcjvoaFKym6ZEnmkEW1aqOXKsnCfOdl7hfR+zQy56zywi
            EwONo9V66JDvt7u1Hio/Waj3qwi2wK/aZmyF4X1/9wtbUhNuL4+k261+JJfUscHe
            U9a2t3BSYqvZzVX/3d+hLArqXFths8XwJH0jnsxH5YebX/O0W/tkGaxOGmuuZ33Z
            Es1ptxV31htOZ3q8kfbKbReDIbiurN+686by1Weo3ai7lYuPBcZmpO2uQ9sgwMCD
            PWJrT3wd7zNq1nITeBW0Dvt4IJF1Ka+o3O6qhianItG8FIE20zPOrtRIRiqu+rrZ
            iBvHqkQzqwCM1Xw9yz8=
            -----END CERTIFICATE-----
        EOT -> null
      ~ domain_name               = "vpn.production.notification.canada.ca" -> "production.notification.canada.ca" # forces replacement
      ~ domain_validation_options = [] -> (known after apply)
      ~ id                        = "arn:aws:acm:ca-central-1:296255494825:certificate/f34d679e-9167-41ff-b525-2a816f6883cd" -> (known after apply)
      ~ key_algorithm             = "RSA_2048" -> (known after apply)
      ~ not_after                 = "2029-01-09T16:02:21Z" -> (known after apply)
      ~ not_before                = "2024-01-11T16:02:21Z" -> (known after apply)
      ~ pending_renewal           = false -> (known after apply)
      - private_key               = (sensitive value) -> null
      ~ renewal_eligibility       = "INELIGIBLE" -> (known after apply)
      ~ renewal_summary           = [] -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          - "vpn.production.notification.canada.ca",
          + "production.notification.canada.ca",
        ]
      ~ tags                      = {
          - "CostCenter"  = "notification-canada-ca-production" -> null
          + "Environment" = "production"
          - "Name"        = "notification-canada-ca" -> null
        }
      ~ tags_all                  = {
          - "CostCenter"  = "notification-canada-ca-production" -> null
          + "Environment" = "production"
          - "Name"        = "notification-canada-ca" -> null
        }
      ~ type                      = "IMPORTED" -> (known after apply)
      ~ validation_emails         = [] -> (known after apply)
      ~ validation_method         = "NONE" -> (known after apply)

      - options {
          - certificate_transparency_logging_preference = "DISABLED" -> null
        }
    }

  # aws_acmpca_certificate.client_vpn will be created
  + resource "aws_acmpca_certificate" "client_vpn" {
      + arn                         = (known after apply)
      + certificate                 = (known after apply)
      + certificate_authority_arn   = (known after apply)
      + certificate_chain           = (known after apply)
      + certificate_signing_request = (known after apply)
      + id                          = (known after apply)
      + signing_algorithm           = "SHA512WITHRSA"
      + template_arn                = "arn:aws:acm-pca:::template/RootCACertificate/V1"

      + validity {
          + type  = "YEARS"
          + value = "5"
        }
    }

  # aws_acmpca_certificate_authority.client_vpn will be created
  + resource "aws_acmpca_certificate_authority" "client_vpn" {
      + arn                             = (known after apply)
      + certificate                     = (known after apply)
      + certificate_chain               = (known after apply)
      + certificate_signing_request     = (known after apply)
      + enabled                         = true
      + id                              = (known after apply)
      + key_storage_security_standard   = (known after apply)
      + not_after                       = (known after apply)
      + not_before                      = (known after apply)
      + permanent_deletion_time_in_days = 7
      + serial                          = (known after apply)
      + tags_all                        = (known after apply)
      + type                            = "ROOT"
      + usage_mode                      = (known after apply)

      + certificate_authority_configuration {
          + key_algorithm     = "RSA_4096"
          + signing_algorithm = "SHA512WITHRSA"

          + subject {
              + common_name = "notification.canada.ca"
            }
        }
    }

  # aws_acmpca_certificate_authority_certificate.client_vpn will be created
  + resource "aws_acmpca_certificate_authority_certificate" "client_vpn" {
      + certificate               = (known after apply)
      + certificate_authority_arn = (known after apply)
      + certificate_chain         = (known after apply)
      + id                        = (known after apply)
    }

  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (1 unchanged element hidden)
                    {
                        height     = 4
                        properties = {
                            metrics   = [
                                [
                                    "AWS/Lambda",
                                    "Invocations",
                                    "FunctionName",
                                    "api-lambda",
                                    {
                                        color  = "#b088f5"
                                        label  = "Calls / min"
                                        region = "ca-central-1"
                                    },
                                ],
                            ]
                            period    = 60
                            region    = "ca-central-1"
                            sparkline = true
                            stat      = "Sum"
                            title     = "API Lambda Invocations"
                            view      = "singleValue"
                        }
                        type       = "metric"
                        width      = 4
                        x          = 8
                        y          = 17
                    },
                  ~ {
                      ~ properties = {
                          ~ query   = <<-EOT
                                SOURCE '/aws/containerinsights/notification-canada-ca-production-eks-cluster/application' | fields @timestamp as Time, kubernetes.container_name as Deployment, log
                                | filter kubernetes.container_name like /^celery/
                              - | filter @message like /ERROR\/.*Worker/
                              + | filter @message like /ERROR\/.*Worker/ or @message like /ERROR\/MainProcess/ 
                                | sort @timestamp desc
                            EOT
                            # (4 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 4
                        properties = {
                            legend    = {
                                position = "hidden"
                            }
                            liveData  = false
                            metrics   = [
                                [
                                    {
                                        expression = "FILL(METRICS(), 0)"
                                        id         = "e1"
                                        label      = "emails /"
                                        region     = "ca-central-1"
                                    },
                                ],
                                [
                                    "AWS/SES",
                                    "Send",
                                    {
                                        color   = "#08aad2"
                                        id      = "m1"
                                        label   = "min"
                                        region  = "ca-central-1"
                                        visible = false
                                    },
                                ],
                            ]
                            period    = 60
                            region    = "ca-central-1"
                            sparkline = true
                            stacked   = false
                            stat      = "Sum"
                            title     = "Email Send Rate Per Minute"
                            view      = "singleValue"
                        }
                        type       = "metric"
                        width      = 8
                        x          = 0
                        y          = 3
                    },
                    # (21 unchanged elements hidden)
                ]
            }
        )
        id             = "Notify-System-Overview"
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_metric_filter.celery-error[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_metric_filter" "celery-error" {
        id             = "celery-error"
        name           = "celery-error"
      ~ pattern        = "?\"ERROR/Worker\" ?\"ERROR/ForkPoolWorker\" ?\"WorkerLostError\"" -> "?\"ERROR/*Worker\" ?\"ERROR/MainProcess\""
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.service-callback-too-many-failures-critical[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "service-callback-too-many-failures-critical" {
      ~ alarm_actions             = [
          - "arn:aws:sns:ca-central-1:296255494825:alert-warning",
          + "arn:aws:sns:ca-central-1:296255494825:alert-critical",
        ]
      ~ alarm_description         = "Service reached the max number of callback retries 25 times in 5 minutes" -> "Service reached the max number of callback retries 100 times in 10 minutes"
        id                        = "service-callback-too-many-failures-warning"
      ~ period                    = 300 -> 600
        tags                      = {}
      ~ threshold                 = 25 -> 100
        # (14 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.celery-errors[0] will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "celery-errors" {
        id                  = "6e83dbc1-06ae-4b00-8414-75835131cbc2"
        name                = "Celery / Errors"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.container_name like /^celery/
          - | filter @message like /ERROR\/.*Worker/
          + | filter @message like /ERROR\/.*Worker/ or @message like /ERROR\/MainProcess/ 
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                   = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version      = "1.30.2-20240828" -> "1.30.2-20240904"
        tags                 = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn            = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20240909151520116700000002" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "terraform-20240909151520116700000002" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # tls_private_key.client_vpn will be destroyed
  # (because tls_private_key.client_vpn is not in configuration)
  - resource "tls_private_key" "client_vpn" {
      - algorithm                     = "RSA" -> null
      - ecdsa_curve                   = "P224" -> null
      - id                            = "b63ec527f5246d06cf2ad5a4279ae69376acdf93" -> null
      - private_key_openssh           = (sensitive value) -> null
      - private_key_pem               = (sensitive value) -> null
      - private_key_pem_pkcs8         = (sensitive value) -> null
      - public_key_fingerprint_md5    = "e0:b5:5e:3e:c2:a5:5a:ab:dd:37:07:ca:c9:3b:bc:ac" -> null
      - public_key_fingerprint_sha256 = "SHA256:/T8s+kM3LpmAfxaHOo1uT2svQhYWElaGrSIRW/NKZdQ" -> null
      - public_key_openssh            = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDDcgsiKuSEy7rH/2+J386LCPGLps43JJDhGr3KzNXnzoF5KftkJonhqXWuMFs8SnHlxF+M0v6OypOmqN56w7kQS5KmxyyEUjd8CTmPpv2/wsq04w67jgwcbcX9AH0o+mZyj0VeYdlzuqesFgyw7zZlnXta2rEURgCH7uW87xVwwaOrX3ezzvaT1IVNesY9/O970AyD5vxkkUVe/otUCQXLlf1gZlzlKNOLQO+gTK0AgtE4b0CmfW8ZbrUhjcSgCJg8hid90CXmILzPxCIZC07OsZXt2HPzBLBRDzidckdaZQULI/RPfuo+MdMbuzwLA/fNHOYT+Wo6666MaAI3kNBF
        EOT -> null
      - public_key_pem                = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAw3ILIirkhMu6x/9vid/O
            iwjxi6bONySQ4Rq9yszV586BeSn7ZCaJ4al1rjBbPEpx5cRfjNL+jsqTpqjeesO5
            EEuSpscshFI3fAk5j6b9v8LKtOMOu44MHG3F/QB9KPpmco9FXmHZc7qnrBYMsO82
            ZZ17WtqxFEYAh+7lvO8VcMGjq193s872k9SFTXrGPfzve9AMg+b8ZJFFXv6LVAkF
            y5X9YGZc5SjTi0DvoEytAILROG9Apn1vGW61IY3EoAiYPIYnfdAl5iC8z8QiGQtO
            zrGV7dhz8wSwUQ84nXJHWmUFCyP0T37qPjHTG7s8CwP3zRzmE/lqOuuujGgCN5DQ
            RQIDAQAB
            -----END PUBLIC KEY-----
        EOT -> null
      - rsa_bits                      = 2048 -> null
    }

  # tls_self_signed_cert.client_vpn will be destroyed
  # (because tls_self_signed_cert.client_vpn is not in configuration)
  - resource "tls_self_signed_cert" "client_vpn" {
      - allowed_uses          = [
          - "key_encipherment",
          - "digital_signature",
          - "server_auth",
          - "ipsec_end_system",
          - "ipsec_tunnel",
          - "any_extended",
          - "cert_signing",
        ] -> null
      - cert_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIDOjCCAiKgAwIBAgIRANUi7I1BEAhBhsuqlkDRcV0wDQYJKoZIhvcNAQELBQAw
            MDEuMCwGA1UEAxMldnBuLnByb2R1Y3Rpb24ubm90aWZpY2F0aW9uLmNhbmFkYS5j
            YTAeFw0yNDAxMTExNjAyMjFaFw0yOTAxMDkxNjAyMjFaMDAxLjAsBgNVBAMTJXZw
            bi5wcm9kdWN0aW9uLm5vdGlmaWNhdGlvbi5jYW5hZGEuY2EwggEiMA0GCSqGSIb3
            DQEBAQUAA4IBDwAwggEKAoIBAQDDcgsiKuSEy7rH/2+J386LCPGLps43JJDhGr3K
            zNXnzoF5KftkJonhqXWuMFs8SnHlxF+M0v6OypOmqN56w7kQS5KmxyyEUjd8CTmP
            pv2/wsq04w67jgwcbcX9AH0o+mZyj0VeYdlzuqesFgyw7zZlnXta2rEURgCH7uW8
            7xVwwaOrX3ezzvaT1IVNesY9/O970AyD5vxkkUVe/otUCQXLlf1gZlzlKNOLQO+g
            TK0AgtE4b0CmfW8ZbrUhjcSgCJg8hid90CXmILzPxCIZC07OsZXt2HPzBLBRDzid
            ckdaZQULI/RPfuo+MdMbuzwLA/fNHOYT+Wo6666MaAI3kNBFAgMBAAGjTzBNMA4G
            A1UdDwEB/wQEAwICpDAtBgNVHSUEJjAkBggrBgEFBQcDAQYIKwYBBQUHAwUGCCsG
            AQUFBwMGBgRVHSUAMAwGA1UdEwEB/wQCMAAwDQYJKoZIhvcNAQELBQADggEBABHR
            4XWiSKSkVfwvjavihQDbcjvoaFKym6ZEnmkEW1aqOXKsnCfOdl7hfR+zQy56zywi
            EwONo9V66JDvt7u1Hio/Waj3qwi2wK/aZmyF4X1/9wtbUhNuL4+k261+JJfUscHe
            U9a2t3BSYqvZzVX/3d+hLArqXFths8XwJH0jnsxH5YebX/O0W/tkGaxOGmuuZ33Z
            Es1ptxV31htOZ3q8kfbKbReDIbiurN+686by1Weo3ai7lYuPBcZmpO2uQ9sgwMCD
            PWJrT3wd7zNq1nITeBW0Dvt4IJF1Ka+o3O6qhianItG8FIE20zPOrtRIRiqu+rrZ
            iBvHqkQzqwCM1Xw9yz8=
            -----END CERTIFICATE-----
        EOT -> null
      - early_renewal_hours   = 672 -> null
      - id                    = "283306899035350548812557128821759897949" -> null
      - is_ca_certificate     = false -> null
      - key_algorithm         = "RSA" -> null
      - private_key_pem       = (sensitive value) -> null
      - ready_for_renewal     = false -> null
      - set_authority_key_id  = false -> null
      - set_subject_key_id    = false -> null
      - validity_end_time     = "2029-01-09T16:02:21.301189421Z" -> null
      - validity_period_hours = 43800 -> null
      - validity_start_time   = "2024-01-11T16:02:21.301189421Z" -> null

      - subject {
          - common_name = "vpn.production.notification.canada.ca" -> null
        }
    }

  # module.gha_vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-0dc4cfa6627940641"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:296255494825:certificate/f34d679e-9167-41ff-b525-2a816f6883cd" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-production"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.aws_ec2_client_vpn_endpoint.this will be updated in-place
  ~ resource "aws_ec2_client_vpn_endpoint" "this" {
        id                      = "cvpn-endpoint-06ea6bb8a835c6e2a"
      ~ server_certificate_arn  = "arn:aws:acm:ca-central-1:296255494825:certificate/f34d679e-9167-41ff-b525-2a816f6883cd" -> (known after apply)
        tags                    = {
            "CostCentre" = "notification-canada-ca-production"
            "Source"     = "cds-snc/terraform-modules/client_vpn"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 5 to add, 7 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error[0]"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acmpca_certificate_authority.client_vpn"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common...
```

</details>
